<a href="https://colab.research.google.com/github/julianovale/PythonFundamentosDSA/blob/main/DSA_Python_Cap04_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
%%writefile teste.txt
testando 1,2,3

Writing teste.txt

In [5]:
arq4 = open('teste.txt','r')
arq4.read()

'testando 1,2,3'

In [6]:
import pandas as pd

In [8]:
df = pd.read_csv('https://raw.githubusercontent.com/julianovale/PythonFundamentosDSA/main/arquivos/binary.csv')
df

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  880  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

In [9]:
df2 = pd.read_csv('https://raw.githubusercontent.com/julianovale/PythonFundamentosDSA/main/arquivos/salarios.csv')
df2

                      Name  ... Employee Annual Salary
0          AARON,  ELVIA J  ...              $88967.00
1        AARON,  JEFFERY M  ...              $80778.00
2           AARON,  KARINA  ...              $80778.00
3      AARON,  KIMBERLEI R  ...              $84780.00
4      ABAD JR,  VICENTE M  ...             $104736.00
...                    ...  ...                    ...
32177   ZYGOWICZ,  PETER J  ...              $86520.00
32178    ZYMANTAS,  MARK E  ...              $83616.00
32179  ZYRKOWSKI,  CARLO E  ...              $86520.00
32180  ZYSKOWSKI,  DARIUSZ  ...             $110352.00
32181                  NaN  ...                    NaN

[32182 rows x 4 columns]